#include <stdio.h>
#include <stdlib.h>

/*(1)_______________________________________________________

__________________________________________________________*/

/*(2)_______________________________________________________

__________________________________________________________*/

int main()
{
    short **matrix;

    // m: 3, n: 3, 요소의 자료형 short
    allocMatrix(&matrix, 3, 3, sizeof(short));

    matrix[0][2] = 10;
    matrix[1][1] = 20;
    printf("%d %d\n", matrix[0][2], matrix[1][1]);

    freeMatrix(&matrix, 3);

    return 0;
}
